micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rif.h
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_rif.h
  * @author  MCD Application Team
  * @brief   Header file of RIF HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_HAL_RIF_H
#define STM32N6xx_HAL_RIF_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal_def.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

/** @addtogroup RIF
  * @{
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RIF_EXPORTED_CONSTANTS_COMMON RIF exported constants - Common
  * @{
  */

/** @defgroup RIF_COMPARTMENT_ID RIF CID number definition
  * @{
  */
#define RIF_CID_NONE                       0x00000000U
#define RIF_CID_0                          0x00000001U
#define RIF_CID_1                          0x00000002U
#define RIF_CID_2                          0x00000004U
#define RIF_CID_3                          0x00000008U
#define RIF_CID_4                          0x00000010U
#define RIF_CID_5                          0x00000020U
#define RIF_CID_6                          0x00000040U
#define RIF_CID_7                          0x00000080U
/**
  * @}
  */

/** @defgroup RIF_MASTER_INDEX RIF Master index
  * @{
  */
#define RIF_MASTER_INDEX_ETR               0U
#if defined(NPU_PRESENT)
#define RIF_MASTER_INDEX_NPU               1U
#endif /* defined(NPU_PRESENT) */
#define RIF_MASTER_INDEX_SDMMC1            2U
#define RIF_MASTER_INDEX_SDMMC2            3U
#define RIF_MASTER_INDEX_OTG1              4U
#define RIF_MASTER_INDEX_OTG2              5U
#define RIF_MASTER_INDEX_ETH1              6U
#define RIF_MASTER_INDEX_GPU2D             7U
#define RIF_MASTER_INDEX_DMA2D             8U
#define RIF_MASTER_INDEX_DCMIPP            9U
#define RIF_MASTER_INDEX_LTDC1             10U
#define RIF_MASTER_INDEX_LTDC2             11U
#define RIF_MASTER_INDEX_VENC              12U
/**
  * @}
  */

/** @defgroup RIF_PERIPHERAL_INDEX RIF RISUP Peripheral index
  * @{
  */
/** @defgroup RIF_PERIPH_PERIPHERAL_INDEX RIF RISUP Peripheral index
  * @{
  */
#define RIF_RISC_PERIPH_INDEX_SPI1         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC0_Pos)
#define RIF_RISC_PERIPH_INDEX_SPI2         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC1_Pos)
#define RIF_RISC_PERIPH_INDEX_SPI3         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC2_Pos)
#define RIF_RISC_PERIPH_INDEX_SPI4         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC3_Pos)
#define RIF_RISC_PERIPH_INDEX_SPI5         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC4_Pos)
#define RIF_RISC_PERIPH_INDEX_SPI6         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC5_Pos)
#define RIF_RISC_PERIPH_INDEX_SAI1         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC6_Pos)
#define RIF_RISC_PERIPH_INDEX_SAI2         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC8_Pos)
#define RIF_RISC_PERIPH_INDEX_I2C1         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC9_Pos)
#define RIF_RISC_PERIPH_INDEX_I2C2         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC10_Pos)
#define RIF_RISC_PERIPH_INDEX_I2C3         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC11_Pos)
#define RIF_RISC_PERIPH_INDEX_I2C4         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC12_Pos)
#define RIF_RISC_PERIPH_INDEX_I3C1         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC13_Pos)
#define RIF_RISC_PERIPH_INDEX_I3C2         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC14_Pos)
#define RIF_RISC_PERIPH_INDEX_USART1       (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC15_Pos)
#define RIF_RISC_PERIPH_INDEX_USART2       (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC16_Pos)
#define RIF_RISC_PERIPH_INDEX_USART3       (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC17_Pos)
#define RIF_RISC_PERIPH_INDEX_UART4        (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC18_Pos)
#define RIF_RISC_PERIPH_INDEX_UART5        (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC19_Pos)
#define RIF_RISC_PERIPH_INDEX_USART6       (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC20_Pos)
#define RIF_RISC_PERIPH_INDEX_UART7        (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC21_Pos)
#define RIF_RISC_PERIPH_INDEX_UART8        (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC22_Pos)
#define RIF_RISC_PERIPH_INDEX_UART9        (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC23_Pos)
#define RIF_RISC_PERIPH_INDEX_USART10      (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC24_Pos)
#define RIF_RISC_PERIPH_INDEX_LPUART1      (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC25_Pos)
#define RIF_RISC_PERIPH_INDEX_FDCAN1       (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC26_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM1         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC27_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM2         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC28_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM3         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC29_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM4         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC30_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM5         (RIF_PERIPH_REG0 | RIFSC_RISC_SECCFGRx_SEC31_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM6         (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC0_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM7         (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC1_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM8         (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC2_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM9         (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC3_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM10        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC4_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM11        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC5_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM12        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC6_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM13        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC7_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM14        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC8_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM15        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC9_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM16        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC10_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM17        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC11_Pos)
#define RIF_RISC_PERIPH_INDEX_TIM18        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC12_Pos)
#define RIF_RISC_PERIPH_INDEX_GFXTIM       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC13_Pos)
#define RIF_RISC_PERIPH_INDEX_LPTIM1       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC14_Pos)
#define RIF_RISC_PERIPH_INDEX_LPTIM2       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC15_Pos)
#define RIF_RISC_PERIPH_INDEX_LPTIM3       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC16_Pos)
#define RIF_RISC_PERIPH_INDEX_LPTIM4       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC17_Pos)
#define RIF_RISC_PERIPH_INDEX_LPTIM5       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC18_Pos)
#define RIF_RISC_PERIPH_INDEX_ADF1         (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC19_Pos)
#define RIF_RISC_PERIPH_INDEX_MDF1         (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC20_Pos)
#define RIF_RISC_PERIPH_INDEX_SDMMC1       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC21_Pos)
#define RIF_RISC_PERIPH_INDEX_SDMMC2       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC22_Pos)
#define RIF_RISC_PERIPH_INDEX_MDIOS        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC23_Pos)
#define RIF_RISC_PERIPH_INDEX_OTG1HS       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC24_Pos)
#define RIF_RISC_PERIPH_INDEX_OTG2HS       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC25_Pos)
#define RIF_RISC_PERIPH_INDEX_UCPD1        (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC26_Pos)
#define RIF_RISC_PERIPH_INDEX_ETH1         (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC28_Pos)
#define RIF_RISC_PERIPH_INDEX_SPDIFRX      (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC29_Pos)
#define RIF_RISC_PERIPH_INDEX_SYSCFG       (RIF_PERIPH_REG1 | RIFSC_RISC_SECCFGRx_SEC30_Pos)
#define RIF_RISC_PERIPH_INDEX_ADC12        (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC0_Pos)
#define RIF_RISC_PERIPH_INDEX_VREFBUF      (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC1_Pos)
#define RIF_RISC_PERIPH_INDEX_CRC          (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC3_Pos)
#define RIF_RISC_PERIPH_INDEX_IWDG         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC4_Pos)
#define RIF_RISC_PERIPH_INDEX_WWDG         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC5_Pos)
#define RIF_RISC_PERIPH_INDEX_RNG          (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC12_Pos)
#define RIF_RISC_PERIPH_INDEX_PKA          (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC13_Pos)
#if defined(CRYP)
#define RIF_RISC_PERIPH_INDEX_SAES         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC14_Pos)
#endif /* defined(CRYP) */
#define RIF_RISC_PERIPH_INDEX_HASH         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC15_Pos)
#if defined(CRYP)
#define RIF_RISC_PERIPH_INDEX_CRYP         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC16_Pos)
#define RIF_RISC_PERIPH_INDEX_MCE1         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC17_Pos)
#define RIF_RISC_PERIPH_INDEX_MCE2         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC18_Pos)
#define RIF_RISC_PERIPH_INDEX_MCE3         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC19_Pos)
#define RIF_RISC_PERIPH_INDEX_MCE4         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC20_Pos)
#endif /* defined(CRYP) */
#define RIF_RISC_PERIPH_INDEX_XSPI1        (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC22_Pos)
#define RIF_RISC_PERIPH_INDEX_XSPI2        (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC23_Pos)
#define RIF_RISC_PERIPH_INDEX_XSPI3        (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC24_Pos)
#define RIF_RISC_PERIPH_INDEX_XSPIM        (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC25_Pos)
#define RIF_RISC_PERIPH_INDEX_FMC          (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC26_Pos)
#define RIF_RISC_PERIPH_INDEX_CSI          (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC28_Pos)
#define RIF_RISC_PERIPH_INDEX_DCMIPP       (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC29_Pos)
#define RIF_RISC_PERIPH_INDEX_DCMI         (RIF_PERIPH_REG2 | RIFSC_RISC_SECCFGRx_SEC30_Pos)
#define RIF_RISC_PERIPH_INDEX_JPEG         (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC0_Pos)
#define RIF_RISC_PERIPH_INDEX_VENC         (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC1_Pos)
#define RIF_RISC_PERIPH_INDEX_ICACHE       (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC2_Pos)
#define RIF_RISC_PERIPH_INDEX_GPU2D        (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC3_Pos)
#define RIF_RISC_PERIPH_INDEX_GFXMMU       (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC4_Pos)
#define RIF_RISC_PERIPH_INDEX_DMA2D        (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC5_Pos)
#define RIF_RISC_PERIPH_INDEX_LTDC         (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC6_Pos)
#define RIF_RISC_PERIPH_INDEX_LTDCL1       (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC7_Pos)
#define RIF_RISC_PERIPH_INDEX_LTDCL2       (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC8_Pos)
#if defined(NPU_PRESENT)
#define RIF_RISC_PERIPH_INDEX_NPU          (RIF_PERIPH_REG3 | RIFSC_RISC_SECCFGRx_SEC10_Pos)
#endif /* defined(NPU_PRESENT) */
/**
  * @}
  */

/** @defgroup RIF_RCC_PERIPHERAL_INDEX RIF RCC Security Control Peripheral index
  * @{
  */
#define RIF_RCC_PERIPH_INDEX_GPDMA1        (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC2_Pos)
#define RIF_RCC_PERIPH_INDEX_HPDMA1        (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC3_Pos)
#define RIF_RCC_PERIPH_INDEX_RTC           (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC5_Pos)
#define RIF_RCC_PERIPH_INDEX_AXISRAM1      (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC12_Pos)
#define RIF_RCC_PERIPH_INDEX_AXISRAM2      (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC13_Pos)
#define RIF_RCC_PERIPH_INDEX_FLEXRAM       (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC17_Pos)
#define RIF_RCC_PERIPH_INDEX_CACHEAXIRAM   (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC18_Pos)
#define RIF_RCC_PERIPH_INDEX_VENCRAM       (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC19_Pos)
#if defined(NPU_PRESENT)
#define RIF_RCC_PERIPH_INDEX_CACHECONFIG   (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC25_Pos)
#endif /* defined(NPU_PRESENT) */
#define RIF_RCC_PERIPH_INDEX_AHBRAM1       (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC27_Pos)
#define RIF_RCC_PERIPH_INDEX_AHBRAM2       (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC28_Pos)
#define RIF_RCC_PERIPH_INDEX_BKPRAM        (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC29_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOA         (RIF_PERIPH_REG4 | RIFSC_RISC_SECCFGRx_SEC31_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOB         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC0_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOC         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC1_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOD         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC2_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOE         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC3_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOF         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC4_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOG         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC5_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOH         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC6_Pos)
#define RIF_RCC_PERIPH_INDEX_GPION         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC8_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOO         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC9_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOP         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC10_Pos)
#define RIF_RCC_PERIPH_INDEX_GPIOQ         (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC11_Pos)
#define RIF_RCC_PERIPH_INDEX_DTS           (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC13_Pos)
#define RIF_RCC_PERIPH_INDEX_MCO1          (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC14_Pos)
#define RIF_RCC_PERIPH_INDEX_MCO2          (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC15_Pos)
#if defined(NPU_PRESENT)
#define RIF_RCC_PERIPH_INDEX_NPURAM0       (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC17_Pos)
#define RIF_RCC_PERIPH_INDEX_NPURAM1       (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC18_Pos)
#define RIF_RCC_PERIPH_INDEX_NPURAM2       (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC19_Pos)
#define RIF_RCC_PERIPH_INDEX_NPURAM3       (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC20_Pos)
#endif /* defined(NPU_PRESENT) */
#define RIF_RCC_PERIPH_INDEX_XSPIPHYCOMP   (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC22_Pos)
#define RIF_RCC_PERIPH_INDEX_XSPIPHY1      (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC23_Pos)
#define RIF_RCC_PERIPH_INDEX_XSPIPHY2      (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC24_Pos)
#define RIF_RCC_PERIPH_INDEX_HDP           (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC27_Pos)
#define RIF_RCC_PERIPH_INDEX_RAMCFG        (RIF_PERIPH_REG5 | RIFSC_RISC_SECCFGRx_SEC30_Pos)
/**
  * @}
  */

/** @defgroup RIF_AWARE_PERIPHERAL_INDEX RIF-aware Peripheral index
  * @{
  */
#define RIF_AWARE_PERIPH_INDEX_CM55        (RIF_PERIPH_REG4 | IAC_IERx_IAIE0_Pos)
#define RIF_AWARE_PERIPH_INDEX_EXTI        (RIF_PERIPH_REG4 | IAC_IERx_IAIE1_Pos)
#define RIF_AWARE_PERIPH_INDEX_GPDMA1      RIF_RCC_PERIPH_INDEX_GPDMA1
#define RIF_AWARE_PERIPH_INDEX_HPDMA1      RIF_RCC_PERIPH_INDEX_HPDMA1
#define RIF_AWARE_PERIPH_INDEX_RTC         RIF_RCC_PERIPH_INDEX_RTC
#define RIF_AWARE_PERIPH_INDEX_TAMP        (RIF_PERIPH_REG4 | IAC_IERx_IAIE6_Pos)
#define RIF_AWARE_PERIPH_INDEX_BSEC        (RIF_PERIPH_REG4 | IAC_IERx_IAIE7_Pos)
#define RIF_AWARE_PERIPH_INDEX_RCC         (RIF_PERIPH_REG4 | IAC_IERx_IAIE8_Pos)
#define RIF_AWARE_PERIPH_INDEX_PWR         (RIF_PERIPH_REG4 | IAC_IERx_IAIE9_Pos)
#define RIF_AWARE_PERIPH_INDEX_IAC         (RIF_PERIPH_REG4 | IAC_IERx_IAIE10_Pos)
#define RIF_AWARE_PERIPH_INDEX_RISAF1      (RIF_PERIPH_REG4 | IAC_IERx_IAIE11_Pos)
#define RIF_AWARE_PERIPH_INDEX_RISAF2      RIF_RCC_PERIPH_INDEX_AXISRAM1
#define RIF_AWARE_PERIPH_INDEX_RISAF3      RIF_RCC_PERIPH_INDEX_AXISRAM2
#if defined(NPU_PRESENT)
#define RIF_AWARE_PERIPH_INDEX_RISAF4      (RIF_PERIPH_REG4 | IAC_IERx_IAIE14_Pos)
#define RIF_AWARE_PERIPH_INDEX_RISAF5      (RIF_PERIPH_REG4 | IAC_IERx_IAIE15_Pos)
#endif /* if defined(NPU_PRESENT) */
#define RIF_AWARE_PERIPH_INDEX_RISAF6      (RIF_PERIPH_REG4 | IAC_IERx_IAIE16_Pos)
#define RIF_AWARE_PERIPH_INDEX_RISAF7      RIF_RCC_PERIPH_INDEX_FLEXRAM
#define RIF_AWARE_PERIPH_INDEX_RISAF8      RIF_RCC_PERIPH_INDEX_CACHEAXIRAM
#define RIF_AWARE_PERIPH_INDEX_RISAF9      RIF_RCC_PERIPH_INDEX_VENCRAM
#define RIF_AWARE_PERIPH_INDEX_RISAF11     (RIF_PERIPH_REG4 | IAC_IERx_IAIE21_Pos)
#define RIF_AWARE_PERIPH_INDEX_RISAF12     (RIF_PERIPH_REG4 | IAC_IERx_IAIE22_Pos)
#define RIF_AWARE_PERIPH_INDEX_RISAF13     (RIF_PERIPH_REG4 | IAC_IERx_IAIE23_Pos)
#define RIF_AWARE_PERIPH_INDEX_RISAF14     (RIF_PERIPH_REG4 | IAC_IERx_IAIE24_Pos)
#if defined(NPU_PRESENT)
#define RIF_AWARE_PERIPH_INDEX_RISAF15     RIF_RCC_PERIPH_INDEX_CACHECONFIG
#endif /* if defined(NPU_PRESENT) */
#define RIF_AWARE_PERIPH_INDEX_RISAF21     RIF_RCC_PERIPH_INDEX_AHBRAM1
#define RIF_AWARE_PERIPH_INDEX_RISAF22     RIF_RCC_PERIPH_INDEX_AHBRAM2
#define RIF_AWARE_PERIPH_INDEX_RISAF23     RIF_RCC_PERIPH_INDEX_BKPRAM
#define RIF_AWARE_PERIPH_INDEX_RIFSC       (RIF_PERIPH_REG4 | IAC_IERx_IAIE30_Pos)
/**
  * @}
  */
/**
  * @}
  */

/** @defgroup RIF_SEC_PRIV RIF Secure Privileged attributes definitions
  * @{
  */
#define RIF_ATTRIBUTE_NSEC                 0x00000000U
#define RIF_ATTRIBUTE_SEC                  0x00000001U
#define RIF_ATTRIBUTE_NPRIV                0x00000000U
#define RIF_ATTRIBUTE_PRIV                 0x00000002U
/**
  * @}
  */

/** @defgroup RIF_ACCESS_TYPE RIF Access type definitions
  * @{
  */
#define RIF_ACCTYPE_READ_FETCH             0U
#define RIF_ACCTYPE_WRITE                  1U
/**
  * @}
  */

/** @defgroup RIF_LOCK_STATE RIF Lock states definitions
  * @{
  */
#define RIF_LOCK_DISABLE                   0U
#define RIF_LOCK_ENABLE                    RIFSC_RIMC_CR_GLOCK
/**
  * @}
  */

/**
  * @}
  */


/** @defgroup RIF_EXPORTED_CONSTANTS_RISAF RIF Exported Constants - RISAF
  * @{
  */

/** @defgroup RIF_RISAF_REGION RISAF Base region definitions
  * @{
  */
#define RISAF_REGION_1                     0U
#define RISAF_REGION_2                     1U
#define RISAF_REGION_3                     2U
#define RISAF_REGION_4                     3U
#define RISAF_REGION_5                     4U
#define RISAF_REGION_6                     5U
#define RISAF_REGION_7                     6U
#define RISAF_REGION_8                     7U
#define RISAF_REGION_9                     8U
#define RISAF_REGION_10                    9U
#define RISAF_REGION_11                    10U
#define RISAF_REGION_12                    11U
#define RISAF_REGION_13                    12U
#define RISAF_REGION_14                    13U
#define RISAF_REGION_15                    14U
/**
  * @}
  */

