micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rif.h
/** @defgroup RIF_RISAF_GRANULARITY RISAF granularity definitions
  * @{
  */
#if !defined(NPU_PRESENT)
#define RISAF1_GRANULARITY                 0x1000U
#define RISAF2_GRANULARITY                 0x1000U
#define RISAF3_GRANULARITY                 0x1000U
#define RISAF6_GRANULARITY                 0x1000U
#define RISAF7_GRANULARITY                 0x1000U
#define RISAF8_GRANULARITY                 0x1000U
#define RISAF9_GRANULARITY                 0x1000U
#define RISAF11_GRANULARITY                0x1000U
#define RISAF12_GRANULARITY                0x1000U
#define RISAF13_GRANULARITY                0x1000U
#define RISAF14_GRANULARITY                0x1000U
#define RISAF21_GRANULARITY                0x0200U
#define RISAF22_GRANULARITY                0x0200U
#define RISAF23_GRANULARITY                0x0200U
#else
#define RISAF1_GRANULARITY                 0x1000U
#define RISAF2_GRANULARITY                 0x1000U
#define RISAF3_GRANULARITY                 0x1000U
#define RISAF4_GRANULARITY                 0x1000U
#define RISAF5_GRANULARITY                 0x1000U
#define RISAF6_GRANULARITY                 0x1000U
#define RISAF7_GRANULARITY                 0x1000U
#define RISAF8_GRANULARITY                 0x1000U
#define RISAF9_GRANULARITY                 0x1000U
#define RISAF11_GRANULARITY                0x1000U
#define RISAF12_GRANULARITY                0x1000U
#define RISAF13_GRANULARITY                0x1000U
#define RISAF14_GRANULARITY                0x1000U
#define RISAF15_GRANULARITY                0x0004U
#define RISAF21_GRANULARITY                0x0200U
#define RISAF22_GRANULARITY                0x0200U
#define RISAF23_GRANULARITY                0x0200U
#endif /* !defined(NPU_PRESENT) */
/**
  * @}
  */

/** @defgroup RIF_RISAF_ADDSPACE RISAF address space sizes definitions
  * @{
  */
#if !defined(NPU_PRESENT)
#define RISAF1_LIMIT_ADDRESS_SPACE_SIZE         0x3FFFFFFFU
#define RISAF2_LIMIT_ADDRESS_SPACE_SIZE         0x000FFFFFU
#define RISAF3_LIMIT_ADDRESS_SPACE_SIZE         0x000FFFFFU
#define RISAF6_LIMIT_ADDRESS_SPACE_SIZE         0xFFFFFFFFU
#define RISAF7_LIMIT_ADDRESS_SPACE_SIZE         0x0007FFFFU
#define RISAF8_LIMIT_ADDRESS_SPACE_SIZE         0x0003FFFFU
#define RISAF9_LIMIT_ADDRESS_SPACE_SIZE         0x0001FFFFU
#define RISAF11_LIMIT_ADDRESS_SPACE_SIZE        0x0FFFFFFFU
#define RISAF12_LIMIT_ADDRESS_SPACE_SIZE        0x0FFFFFFFU
#define RISAF13_LIMIT_ADDRESS_SPACE_SIZE        0x0FFFFFFFU
#define RISAF14_LIMIT_ADDRESS_SPACE_SIZE        0x0FFFFFFFU
#define RISAF21_LIMIT_ADDRESS_SPACE_SIZE        0x00001FFFU
#define RISAF22_LIMIT_ADDRESS_SPACE_SIZE        0x00001FFFU
#define RISAF23_LIMIT_ADDRESS_SPACE_SIZE        0x00000FFFU
#else
#define RISAF1_LIMIT_ADDRESS_SPACE_SIZE         0x3FFFFFFFU
#define RISAF2_LIMIT_ADDRESS_SPACE_SIZE         0x000FFFFFU
#define RISAF3_LIMIT_ADDRESS_SPACE_SIZE         0x000FFFFFU
#define RISAF4_LIMIT_ADDRESS_SPACE_SIZE         0xFFFFFFFFU
#define RISAF5_LIMIT_ADDRESS_SPACE_SIZE         0xFFFFFFFFU
#define RISAF6_LIMIT_ADDRESS_SPACE_SIZE         0xFFFFFFFFU
#define RISAF7_LIMIT_ADDRESS_SPACE_SIZE         0x0007FFFFU
#define RISAF8_LIMIT_ADDRESS_SPACE_SIZE         0x0003FFFFU
#define RISAF9_LIMIT_ADDRESS_SPACE_SIZE         0x0001FFFFU
#define RISAF11_LIMIT_ADDRESS_SPACE_SIZE        0x0FFFFFFFU
#define RISAF12_LIMIT_ADDRESS_SPACE_SIZE        0x0FFFFFFFU
#define RISAF13_LIMIT_ADDRESS_SPACE_SIZE        0x0FFFFFFFU
#define RISAF14_LIMIT_ADDRESS_SPACE_SIZE        0x0FFFFFFFU
#define RISAF15_LIMIT_ADDRESS_SPACE_SIZE        0x00000FFFU
#define RISAF21_LIMIT_ADDRESS_SPACE_SIZE        0x00001FFFU
#define RISAF22_LIMIT_ADDRESS_SPACE_SIZE        0x00001FFFU
#define RISAF23_LIMIT_ADDRESS_SPACE_SIZE        0x00000FFFU
#endif /* !defined(NPU_PRESENT) */
/**
  * @}
  */

/** @defgroup RIF_RISAF_SUBREGION RIF subregion definitions
  * @{
  */
#define RISAF_SUBREGION_A                  0U
#define RISAF_SUBREGION_B                  1U
/**
  * @}
  */

/** @defgroup RIF_RISAF_FILTERING_MODE RISAF Filtering mode definitions
  * @{
  */
#define RISAF_FILTER_DISABLE               0U
#define RISAF_FILTER_ENABLE                RISAF_REGx_CFGR_BREN
/**
  * @}
  */

/** @defgroup RIF_RISAF_DELEGATION_MODE RISAF Delegation mode definitions
  * @{
  */
#define RISAF_DELEGATION_DISABLE           0U
#define RISAF_DELEGATION_ENABLE            RISAF_REGx_zNESTR_DCEN
/**
  * @}
  */

/** @defgroup RIF_RISAF_READ_WRITE RISAF Read/Write definitions
  * @{
  */
#define RISAF_READ_DISABLE                 0U
#define RISAF_READ_ENABLE                  RISAF_REGx_zCFGR_RDEN
#define RISAF_WRITE_DISABLE                0U
#define RISAF_WRITE_ENABLE                 RISAF_REGx_zCFGR_WREN
/**
  * @}
  */

/** @defgroup RIF_RISAF_ILLEGAL_ACCESS RISAF Illegal Access definitions
  * @{
  */
#define RISAF_ILLEGAL_ACCESS_NONE          0U
#define RISAF_ILLEGAL_CONFIGURATION_ACCESS RISAF_IASR_CAEF
#define RISAF_ILLEGAL_ACCESS               RISAF_IASR_IAEF
/**
  * @}
  */

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RIF_Exported_Types RIF Exported Types
  * @{
  */

/**
  * @brief  RIFSC Master CID attributes configuration structure
  */
typedef struct
{
  uint32_t MasterCID; /*!< One of @ref RIF_COMPARTMENT_ID        */
  uint32_t SecPriv;   /*!< A combination of @ref RIF_SEC_PRIV    */
} RIMC_MasterConfig_t;

/**
  * @brief  RISAF base region configuration structure
  */
typedef struct
{
  uint32_t Filtering;       /*!< One of @ref RIF_RISAF_FILTERING_MODE      */
  uint32_t Secure;          /*!< One of @ref RIF_SEC_PRIV                  */
  uint32_t PrivWhitelist;   /*!< A combination of @ref RIF_COMPARTMENT_ID  */
  uint32_t ReadWhitelist;   /*!< A combination of @ref RIF_COMPARTMENT_ID  */
  uint32_t WriteWhitelist;  /*!< A combination of @ref RIF_COMPARTMENT_ID  */
  uint32_t StartAddress;    /*!< Base region start, address offset to the base address of the protected address space */
  uint32_t EndAddress;      /*!< Base region end, address offset to the base address of the protected address space   */
} RISAF_BaseRegionConfig_t;

/**
  * @brief  RISAF subregion configuration structure
  */
typedef struct
{
  uint32_t Filtering;    /*!< One of @ref RIF_RISAF_FILTERING_MODE           */
  uint32_t CID;          /*!< One of @ref RIF_COMPARTMENT_ID                 */
  uint32_t SecPriv;      /*!< A combination of @ref RIF_SEC_PRIV             */
  uint32_t ReadWrite;    /*!< A combination of @ref RIF_RISAF_READ_WRITE     */
  uint32_t Lock;         /*!< One of @ref RIF_LOCK_STATE                     */
  uint32_t StartAddress; /*!< Subregion start, address offset to the base address of the protected address space */
  uint32_t EndAddress;   /*!< Subregion end, address offset to the base address of the protected address space   */
} RISAF_SubRegionConfig_t;

/**
  * @brief  RISAF delegation structure
  */
typedef struct
{
  uint32_t Delegation;   /*!< Enable or Disable               */
  uint32_t DelegatedCID; /*!< One of @ref RIF_COMPARTMENT_ID  */
} RISAF_DelegationConfig_t;

/**
  * @brief  RISAF illegal access detection structure
  */
/**
  * @brief  RISAF illegal access detection data structure
  */
typedef struct
{
  uint32_t CID;        /*!< One of @ref RIF_COMPARTMENT_ID      */
  uint32_t SecPriv;    /*!< A combination of @ref RIF_SEC_PRIV  */
  uint32_t AccessType; /*!< One of @ref RIF_ACCESS_TYPE         */
  uint32_t Address;
} RISAF_IllegalAccessData_t;

typedef struct
{
  uint32_t ErrorType; /*!< One of @ref RIF_RISAF_ILLEGAL_ACCESS      */
  RISAF_IllegalAccessData_t Data;
} RISAF_IllegalAccess_t;

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_Private_Constants RCC Private Constants
  * @{
  */

/** @defgroup RIF_REG_INDEX RIF register index definition
  * @{
  */
/* Composition definition for Peripheral identifier parameter (PeriphId) used in
 * RIF RISC and IAC related functions.
 * Bitmap Definition
  *     bits[31:28] define the register index a peripheral belongs to, value from 0 to 5.
  *     bits[4:0]   define the bit position within the register, value from 0 to 31.
 */
#define RIF_PERIPH_REG_SHIFT               28U
#define RIF_PERIPH_REG                     0xF0000000U
#define RIF_PERIPH_REG0                    0x00000000U
#define RIF_PERIPH_REG1                    0x10000000U
#define RIF_PERIPH_REG2                    0x20000000U
#define RIF_PERIPH_REG3                    0x30000000U
#define RIF_PERIPH_REG4                    0x40000000U
#define RIF_PERIPH_REG5                    0x50000000U
#define RIF_PERIPH_BIT_POSITION            0x0000001FU
/**
  * @}
  */

/** @defgroup RIF_MASK RIF register masks
  * @{
  */
#define RIF_CID_MASK                       0x000000FFU
#define RIF_ATTRIBUTE_MASK                 0x00000003U
#define RISAF_READ_WRITE_MASK              (RISAF_READ_ENABLE | RISAF_WRITE_ENABLE)
/**
  * @}
  */

/**
  * @}
  */

