micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rif.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup RIF_Private_Macros_Common RIF Private Macros - Common
  * @{
  */
#define IS_RIF_CID(__CID__)  (((uint32_t)(__CID__) & ~RIF_CID_MASK) == 0x00U)

#define IS_RIF_SINGLE_CID(__CID__)   (((__CID__) == RIF_CID_0)  || \
                                      ((__CID__) == RIF_CID_1)  || \
                                      ((__CID__) == RIF_CID_2)  || \
                                      ((__CID__) == RIF_CID_3)  || \
                                      ((__CID__) == RIF_CID_4)  || \
                                      ((__CID__) == RIF_CID_5)  || \
                                      ((__CID__) == RIF_CID_6)  || \
                                      ((__CID__) == RIF_CID_7))

#define IS_RIF_MASTER_CID(__CID__)  (((uint32_t)(__CID__) != RIF_CID_7) && \
                                     (((uint32_t)(__CID__) & ~RIF_CID_MASK) == 0x00U))


#if defined(NPU_PRESENT)
#define IS_RIF_MASTER_INDEX(__INDEX__)  (((__INDEX__) == RIF_MASTER_INDEX_ETR)    || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_NPU)    || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_SDMMC1) || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_SDMMC2) || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_OTG1)   || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_OTG2)   || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_ETH1)   || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_GPU2D)  || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_DMA2D)  || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_DCMIPP) || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_LTDC1)  || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_LTDC2)  || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_VENC))
#else
#define IS_RIF_MASTER_INDEX(__INDEX__)  (((__INDEX__) == RIF_MASTER_INDEX_ETR)    || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_SDMMC1) || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_SDMMC2) || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_OTG1)   || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_OTG2)   || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_ETH1)   || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_GPU2D)  || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_DMA2D)  || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_DCMIPP) || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_LTDC1)  || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_LTDC2)  || \
                                         ((__INDEX__) == RIF_MASTER_INDEX_VENC))
#endif /* defined(NPU_PRESENT) */

#if !defined(NPU_PRESENT) && !defined(CRYP)
#define IS_RIF_RISC_PERIPH_INDEX(__INDEX__)  (((__INDEX__) == RIF_RISC_PERIPH_INDEX_SPI1)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SPI2)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SPI3)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SPI4)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SPI5)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SPI6)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SAI1)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SAI2)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_I2C1)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_I2C2)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_I2C3)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_I2C4)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_I3C1)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_I3C2)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_USART1)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_USART2)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_USART3)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_UART4)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_UART5)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_USART6)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_UART7)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_UART8)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_UART9)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_USART10)       || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LPUART1)       || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_FDCAN1)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM1)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM2)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM3)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM4)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM5)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM6)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM7)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM8)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM9)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM10)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM11)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM12)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM13)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM14)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM15)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM16)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM17)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_TIM18)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_GFXTIM)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LPTIM1)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LPTIM2)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LPTIM3)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LPTIM4)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LPTIM5)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_ADF1)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_MDF1)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SDMMC1)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SDMMC2)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_MDIOS)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_OTG1HS)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_OTG2HS)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_UCPD1)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_ETH1)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SPDIFRX)       || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_SYSCFG)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_ADC12)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_VREFBUF)       || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_CRC)           || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_IWDG)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_WWDG)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_RNG)           || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_PKA)           || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_HASH)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_XSPI1)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_XSPI2)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_XSPI3)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_XSPIM)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_FMC)           || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_CSI)           || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_DCMIPP)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_DCMI)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_JPEG)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_VENC)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_ICACHE)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_GPU2D)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_GFXMMU)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_DMA2D)         || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LTDC)          || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LTDCL1)        || \
                                              ((__INDEX__) == RIF_RISC_PERIPH_INDEX_LTDCL2))

#define IS_RIF_RCC_PERIPH_INDEX(__INDEX__)   (((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPDMA1)         || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_HPDMA1)         || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_RTC)            || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_AXISRAM1)       || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_AXISRAM2)       || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_FLEXRAM)        || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_CACHEAXIRAM)    || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_VENCRAM)        || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_AHBRAM1)        || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_AHBRAM2)        || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_BKPRAM)         || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOA)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOB)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOC)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOD)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOE)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOF)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOG)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOH)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPION)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOO)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOP)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_GPIOQ)          || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_DTS)            || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_MCO1)           || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_MCO2)           || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_XSPIPHYCOMP)    || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_XSPIPHY1)       || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_XSPIPHY2)       || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_HDP)            || \
                                              ((__INDEX__) == RIF_RCC_PERIPH_INDEX_RAMCFG))

