micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rif.h
#define IS_RIF_AWARE_PERIPH_INDEX(__INDEX__) (((__INDEX__) == RIF_AWARE_PERIPH_INDEX_CM55)         || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_EXTI)         || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_GPDMA1)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_HPDMA1)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RTC)          || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_TAMP)         || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_BSEC)         || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RCC)          || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_PWR)          || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_IAC)          || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF1)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF2)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF3)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF4)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF5)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF6)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF7)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF8)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF9)       || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF11)      || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF12)      || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF13)      || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF14)      || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF15)      || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF21)      || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF22)      || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RISAF23)      || \
                                              ((__INDEX__) == RIF_AWARE_PERIPH_INDEX_RIFSC))
#endif /* defined(NPU_PRESENT) && defined(CRYP) */

#define IS_RIF_SEC_PRIV_ATTRIBUTE(__ATTRIBUTE__)  (((uint32_t)(__ATTRIBUTE__) & ~RIF_ATTRIBUTE_MASK) == 0x00U)

#define IS_RIF_ACCESS_TYPE(__ACCTYPE__)  (((__ACCTYPE__) == RIF_ACCTYPE_READ_FETCH) || \
                                          ((__ACCTYPE__) == RIF_ACCTYPE_WRITE))

#define IS_RIF_LOCK_STATE(__LOCK__)  (((__LOCK__) == RIF_LOCK_DISABLE) || \
                                      ((__LOCK__) == RIF_LOCK_ENABLE))
/**
  * @}
  */

/** @defgroup RIF_Private_Macros_RISAF RIF Private Macros - RISAF
  * @{
  */

#if !defined(NPU_PRESENT)
#define IS_RISAF_INSTANCE(__INSTANCE__) (((__INSTANCE__) == RISAF1)   || \
                                         ((__INSTANCE__) == RISAF2)   || \
                                         ((__INSTANCE__) == RISAF3)   || \
                                         ((__INSTANCE__) == RISAF6)   || \
                                         ((__INSTANCE__) == RISAF7)   || \
                                         ((__INSTANCE__) == RISAF8)   || \
                                         ((__INSTANCE__) == RISAF9)   || \
                                         ((__INSTANCE__) == RISAF11)  || \
                                         ((__INSTANCE__) == RISAF12)  || \
                                         ((__INSTANCE__) == RISAF13)  || \
                                         ((__INSTANCE__) == RISAF14)  || \
                                         ((__INSTANCE__) == RISAF21)  || \
                                         ((__INSTANCE__) == RISAF22)  || \
                                         ((__INSTANCE__) == RISAF23))
#else
#define IS_RISAF_INSTANCE(__INSTANCE__) (((__INSTANCE__) == RISAF1)   || \
                                         ((__INSTANCE__) == RISAF2)   || \
                                         ((__INSTANCE__) == RISAF3)   || \
                                         ((__INSTANCE__) == RISAF4)   || \
                                         ((__INSTANCE__) == RISAF5)   || \
                                         ((__INSTANCE__) == RISAF6)   || \
                                         ((__INSTANCE__) == RISAF7)   || \
                                         ((__INSTANCE__) == RISAF8)   || \
                                         ((__INSTANCE__) == RISAF9)   || \
                                         ((__INSTANCE__) == RISAF11)  || \
                                         ((__INSTANCE__) == RISAF12)  || \
                                         ((__INSTANCE__) == RISAF13)  || \
                                         ((__INSTANCE__) == RISAF14)  || \
                                         ((__INSTANCE__) == RISAF15)  || \
                                         ((__INSTANCE__) == RISAF21)  || \
                                         ((__INSTANCE__) == RISAF22)  || \
                                         ((__INSTANCE__) == RISAF23))
#endif /* !defined(NPU_PRESENT) */

#define IS_RISAF_REGION(__REGION__)  (((__REGION__) == RISAF_REGION_1)  || \
                                      ((__REGION__) == RISAF_REGION_2)  || \
                                      ((__REGION__) == RISAF_REGION_3)  || \
                                      ((__REGION__) == RISAF_REGION_4)  || \
                                      ((__REGION__) == RISAF_REGION_5)  || \
                                      ((__REGION__) == RISAF_REGION_6)  || \
                                      ((__REGION__) == RISAF_REGION_7)  || \
                                      ((__REGION__) == RISAF_REGION_8)  || \
                                      ((__REGION__) == RISAF_REGION_9)  || \
                                      ((__REGION__) == RISAF_REGION_10) || \
                                      ((__REGION__) == RISAF_REGION_11) || \
                                      ((__REGION__) == RISAF_REGION_12) || \
                                      ((__REGION__) == RISAF_REGION_13) || \
                                      ((__REGION__) == RISAF_REGION_14) || \
                                      ((__REGION__) == RISAF_REGION_15))

#if !defined(NPU_PRESENT)
#define IS_RISAF_MAX_REGION(__INSTANCE__, __REGION__)    (((__INSTANCE__) == RISAF1)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF2)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF3)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF6)  ? ((__REGION__) <= RISAF_REGION_11) : \
                                                          ((__INSTANCE__) == RISAF7)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF8)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF9)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF11) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF12) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF13) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF14) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF21) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF22) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__REGION__) <= RISAF_REGION_3))
#else
#define IS_RISAF_MAX_REGION(__INSTANCE__, __REGION__)    (((__INSTANCE__) == RISAF1)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF2)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF3)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF4)  ? ((__REGION__) <= RISAF_REGION_11) : \
                                                          ((__INSTANCE__) == RISAF5)  ? ((__REGION__) <= RISAF_REGION_11) : \
                                                          ((__INSTANCE__) == RISAF6)  ? ((__REGION__) <= RISAF_REGION_11) : \
                                                          ((__INSTANCE__) == RISAF7)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF8)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF9)  ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF11) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF12) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF13) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF14) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF15) ? ((__REGION__) <= RISAF_REGION_2)  : \
                                                          ((__INSTANCE__) == RISAF21) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__INSTANCE__) == RISAF22) ? ((__REGION__) <= RISAF_REGION_7)  : \
                                                          ((__REGION__) <= RISAF_REGION_3))
#endif /* !defined(NPU_PRESENT) */

#if !defined(NPU_PRESENT)
#define IS_RISAF_GRANULARITY(__INSTANCE__, __ADDRESS__)  ((((__INSTANCE__) == RISAF1)  ? ((__ADDRESS__) % RISAF1_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF2)  ? ((__ADDRESS__) % RISAF2_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF3)  ? ((__ADDRESS__) % RISAF3_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF6)  ? ((__ADDRESS__) % RISAF6_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF7)  ? ((__ADDRESS__) % RISAF7_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF8)  ? ((__ADDRESS__) % RISAF8_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF9)  ? ((__ADDRESS__) % RISAF9_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF11) ? ((__ADDRESS__) % RISAF11_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF12) ? ((__ADDRESS__) % RISAF12_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF13) ? ((__ADDRESS__) % RISAF13_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF14) ? ((__ADDRESS__) % RISAF14_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF21) ? ((__ADDRESS__) % RISAF21_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF22) ? ((__ADDRESS__) % RISAF22_GRANULARITY) : \
                                                           ((__ADDRESS__) % RISAF23_GRANULARITY)) == 0x00U)
#else
#define IS_RISAF_GRANULARITY(__INSTANCE__, __ADDRESS__)  ((((__INSTANCE__) == RISAF1)  ? ((__ADDRESS__) % RISAF1_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF2)  ? ((__ADDRESS__) % RISAF2_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF3)  ? ((__ADDRESS__) % RISAF3_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF4)  ? ((__ADDRESS__) % RISAF4_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF5)  ? ((__ADDRESS__) % RISAF5_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF6)  ? ((__ADDRESS__) % RISAF6_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF7)  ? ((__ADDRESS__) % RISAF7_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF8)  ? ((__ADDRESS__) % RISAF8_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF9)  ? ((__ADDRESS__) % RISAF9_GRANULARITY)  : \
                                                           ((__INSTANCE__) == RISAF11) ? ((__ADDRESS__) % RISAF11_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF12) ? ((__ADDRESS__) % RISAF12_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF13) ? ((__ADDRESS__) % RISAF13_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF14) ? ((__ADDRESS__) % RISAF14_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF15) ? ((__ADDRESS__) % RISAF15_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF21) ? ((__ADDRESS__) % RISAF21_GRANULARITY) : \
                                                           ((__INSTANCE__) == RISAF22) ? ((__ADDRESS__) % RISAF22_GRANULARITY) : \
                                                           ((__ADDRESS__) % RISAF23_GRANULARITY)) == 0x00U)
#endif /* !defined(NPU_PRESENT) */

#if !defined(NPU_PRESENT)
#define IS_RISAF_LIMIT_ADDRESS_SPACE_SIZE(__INSTANCE__, __ADDRESS__)   ((((__INSTANCE__) == RISAF1)  && ((__ADDRESS__) < (RISAF1_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF2)  && ((__ADDRESS__) < (RISAF2_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF3)  && ((__ADDRESS__) < (RISAF3_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        ((__INSTANCE__) == RISAF6)  || \
                                                                        (((__INSTANCE__) == RISAF7)  && ((__ADDRESS__) < (RISAF7_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF8)  && ((__ADDRESS__) < (RISAF8_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF9)  && ((__ADDRESS__) < (RISAF9_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF11) && ((__ADDRESS__) < (RISAF11_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF12) && ((__ADDRESS__) < (RISAF12_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF13) && ((__ADDRESS__) < (RISAF13_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF14) && ((__ADDRESS__) < (RISAF14_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF21) && ((__ADDRESS__) < (RISAF21_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF22) && ((__ADDRESS__) < (RISAF22_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF23) && ((__ADDRESS__) < (RISAF23_LIMIT_ADDRESS_SPACE_SIZE + 1U))))
#else
#define IS_RISAF_LIMIT_ADDRESS_SPACE_SIZE(__INSTANCE__, __ADDRESS__)   ((((__INSTANCE__) == RISAF1)  && ((__ADDRESS__) < (RISAF1_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF2)  && ((__ADDRESS__) < (RISAF2_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF3)  && ((__ADDRESS__) < (RISAF3_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        ((__INSTANCE__) == RISAF4)  || \
                                                                        ((__INSTANCE__) == RISAF5)  || \
                                                                        ((__INSTANCE__) == RISAF6)  || \
                                                                        (((__INSTANCE__) == RISAF7)  && ((__ADDRESS__) < (RISAF7_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF8)  && ((__ADDRESS__) < (RISAF8_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF9)  && ((__ADDRESS__) < (RISAF9_LIMIT_ADDRESS_SPACE_SIZE + 1U)))  || \
                                                                        (((__INSTANCE__) == RISAF11) && ((__ADDRESS__) < (RISAF11_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF12) && ((__ADDRESS__) < (RISAF12_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF13) && ((__ADDRESS__) < (RISAF13_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF14) && ((__ADDRESS__) < (RISAF14_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF15) && ((__ADDRESS__) < (RISAF15_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF21) && ((__ADDRESS__) < (RISAF21_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF22) && ((__ADDRESS__) < (RISAF22_LIMIT_ADDRESS_SPACE_SIZE + 1U))) || \
                                                                        (((__INSTANCE__) == RISAF23) && ((__ADDRESS__) < (RISAF23_LIMIT_ADDRESS_SPACE_SIZE + 1U))))
#endif /* !defined(NPU_PRESENT) */

#define IS_RISAF_SUBREGION(__SUBREGION__)  (((__SUBREGION__) == RISAF_SUBREGION_A) || \
                                            ((__SUBREGION__) == RISAF_SUBREGION_B))

#define IS_RISAF_FILTERING(__FILTERING__)  (((__FILTERING__) == RISAF_FILTER_DISABLE) || \
                                            ((__FILTERING__) == RISAF_FILTER_ENABLE))

#define IS_RISAF_DELEGATION(__DELEGATION__)  (((__DELEGATION__) == RISAF_DELEGATION_DISABLE) || \
                                              ((__DELEGATION__) == RISAF_DELEGATION_ENABLE))


#define IS_RISAF_READ_WRITE(__RW__)  (((uint32_t)(__RW__) == RISAF_READ_DISABLE) || \
                                      (((uint32_t)(__RW__) & ~RISAF_READ_WRITE_MASK) == 0x00U))
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RIF_Exported_Functions RIF Exported Functions
  * @{
  */
/** @defgroup RIF_Exported_Functions_Group1 RIMC Configuration functions
  * @{
  */
#if defined(CPU_AS_TRUSTED_DOMAIN)
void     HAL_RIF_RIMC_Lock(void);
#endif /* CPU_AS_TRUSTED_DOMAIN */
uint32_t HAL_RIF_RIMC_GetLock(void);
#if defined(CPU_AS_TRUSTED_DOMAIN)
void     HAL_RIF_RIMC_SetDebugAccessPortCID(uint32_t CID);
#endif /* CPU_AS_TRUSTED_DOMAIN */
uint32_t HAL_RIF_RIMC_GetDebugAccessPortCID(void);
#if defined(CPU_AS_TRUSTED_DOMAIN)
void     HAL_RIF_RIMC_ConfigMasterAttributes(uint32_t MasterId, const RIMC_MasterConfig_t *pConfig);
void     HAL_RIF_RIMC_GetConfigMasterAttributes(uint32_t MasterId, RIMC_MasterConfig_t *pConfig);
#endif /* CPU_AS_TRUSTED_DOMAIN */
/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group2 RIFSC Configuration functions
  * @{
  */
#if defined(CPU_AS_TRUSTED_DOMAIN)
void       HAL_RIF_RISC_Lock(void);
#endif /* CPU_AS_TRUSTED_DOMAIN */
uint32_t   HAL_RIF_RISC_GetLock(void);
void       HAL_RIF_RISC_SetSlaveSecureAttributes(uint32_t PeriphId, uint32_t SecPriv);
uint32_t   HAL_RIF_RISC_GetSlaveSecureAttributes(uint32_t PeriphId);
void       HAL_RIF_RISC_SlaveConfigLock(uint32_t PeriphId);
uint32_t   HAL_RIF_RISC_GetSlaveConfigLock(uint32_t PeriphId);
/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group4 RISAF Configuration functions
  * @{
  */
#if defined(CPU_AS_TRUSTED_DOMAIN)
void      HAL_RIF_RISAF_Lock(RISAF_TypeDef *RISAFx);
#endif /* CPU_AS_TRUSTED_DOMAIN */
uint32_t  HAL_RIF_RISAF_GetLock(const RISAF_TypeDef *RISAFx);
#if defined(CPU_AS_TRUSTED_DOMAIN)
void      HAL_RIF_RISAF_ConfigBaseRegion(RISAF_TypeDef *RISAFx, uint32_t Region,
                                         const RISAF_BaseRegionConfig_t *pConfig);
#endif /* CPU_AS_TRUSTED_DOMAIN */
void      HAL_RIF_RISAF_GetConfigBaseRegion(const RISAF_TypeDef *RISAFx, uint32_t Region,
                                            RISAF_BaseRegionConfig_t *pConfig);
#if defined(CPU_AS_TRUSTED_DOMAIN)
void HAL_RIF_RISAF_ConfigSubRegionDelegation(RISAF_TypeDef *RISAFx, uint32_t Region, uint32_t SubRegion,
                                             const RISAF_DelegationConfig_t *pConfig);
#endif /* CPU_AS_TRUSTED_DOMAIN */
void      HAL_RIF_RISAF_GetConfigSubRegionDelegation(const RISAF_TypeDef *RISAFx, uint32_t Region, uint32_t SubRegion,
                                                     RISAF_DelegationConfig_t *pConfig);
#if defined(CPU_AS_TRUSTED_DOMAIN)
void      HAL_RIF_RISAF_ConfigSubRegion(RISAF_TypeDef *RISAFx, uint32_t Region, uint32_t SubRegion,
                                        const RISAF_SubRegionConfig_t *pConfig);
#endif /* CPU_AS_TRUSTED_DOMAIN */
void      HAL_RIF_RISAF_GetConfigSubRegion(const RISAF_TypeDef *RISAFx, uint32_t Region, uint32_t SubRegion,
                                           RISAF_SubRegionConfig_t *pConfig);
#if defined(CPU_AS_TRUSTED_DOMAIN)
void      HAL_RIF_RISAF_GetIllegalAccess(RISAF_TypeDef *RISAFx, RISAF_IllegalAccess_t *IllegalAccess);
#endif /* CPU_AS_TRUSTED_DOMAIN */
/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group6 IAC Configuration functions
  * @{
  */
#if defined(CPU_AS_TRUSTED_DOMAIN) && defined(CPU_IN_SECURE_STATE)
void      HAL_RIF_IAC_EnableIT(uint32_t PeriphId);
void      HAL_RIF_IAC_DisableIT(uint32_t PeriphId);
uint32_t  HAL_RIF_IAC_GetFlag(uint32_t PeriphId);
void      HAL_RIF_IAC_ClearFlag(uint32_t PeriphId);
void      HAL_RIF_IRQHandler(void);
void      HAL_RIF_ILA_Callback(uint32_t PeriphId);
#endif /* CPU_AS_TRUSTED_DOMAIN && CPU_IN_SECURE_STATE */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32N6xx_HAL_RIF_H */

